test-load-results/k6-fastapi-json-results.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: /load.js
     output: -

  scenarios: (100.00%) 1 scenario, 60 max VUs, 2m30s max duration (incl. graceful stop):
           * default: Up to 60 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/60 VUs, 5 complete and 0 interrupted iterations
default   [   1% ] 01/60 VUs  0m01.0s/2m00.0s

running (0m02.0s), 02/60 VUs, 13 complete and 0 interrupted iterations
default   [   2% ] 02/60 VUs  0m02.0s/2m00.0s

running (0m03.0s), 02/60 VUs, 23 complete and 0 interrupted iterations
default   [   2% ] 02/60 VUs  0m03.0s/2m00.0s

running (0m04.0s), 03/60 VUs, 35 complete and 0 interrupted iterations
default   [   3% ] 03/60 VUs  0m04.0s/2m00.0s

running (0m05.0s), 04/60 VUs, 44 complete and 0 interrupted iterations
default   [   4% ] 04/60 VUs  0m05.0s/2m00.0s

running (0m06.0s), 04/60 VUs, 64 complete and 0 interrupted iterations
default   [   5% ] 04/60 VUs  0m06.0s/2m00.0s

running (0m07.0s), 05/60 VUs, 73 complete and 0 interrupted iterations
default   [   6% ] 05/60 VUs  0m07.0s/2m00.0s

running (0m08.0s), 06/60 VUs, 81 complete and 0 interrupted iterations
default   [   7% ] 06/60 VUs  0m08.0s/2m00.0s

running (0m09.0s), 06/60 VUs, 88 complete and 0 interrupted iterations
default   [   7% ] 06/60 VUs  0m09.0s/2m00.0s

running (0m10.0s), 07/60 VUs, 102 complete and 0 interrupted iterations
default   [   8% ] 07/60 VUs  0m10.0s/2m00.0s

running (0m11.0s), 07/60 VUs, 110 complete and 0 interrupted iterations
default   [   9% ] 07/60 VUs  0m11.0s/2m00.0s

running (0m12.0s), 08/60 VUs, 119 complete and 0 interrupted iterations
default   [  10% ] 08/60 VUs  0m12.0s/2m00.0s

running (0m13.0s), 09/60 VUs, 134 complete and 0 interrupted iterations
default   [  11% ] 09/60 VUs  0m13.0s/2m00.0s

running (0m14.0s), 09/60 VUs, 160 complete and 0 interrupted iterations
default   [  12% ] 09/60 VUs  0m14.0s/2m00.0s

running (0m15.0s), 10/60 VUs, 187 complete and 0 interrupted iterations
default   [  12% ] 10/60 VUs  0m15.0s/2m00.0s

running (0m16.0s), 11/60 VUs, 214 complete and 0 interrupted iterations
default   [  13% ] 11/60 VUs  0m16.0s/2m00.0s

running (0m17.0s), 11/60 VUs, 242 complete and 0 interrupted iterations
default   [  14% ] 11/60 VUs  0m17.0s/2m00.0s

running (0m18.0s), 12/60 VUs, 272 complete and 0 interrupted iterations
default   [  15% ] 12/60 VUs  0m18.0s/2m00.0s

running (0m19.0s), 13/60 VUs, 306 complete and 0 interrupted iterations
default   [  16% ] 13/60 VUs  0m19.0s/2m00.0s

running (0m20.0s), 13/60 VUs, 338 complete and 0 interrupted iterations
default   [  17% ] 13/60 VUs  0m20.0s/2m00.0s

running (0m21.0s), 14/60 VUs, 371 complete and 0 interrupted iterations
default   [  17% ] 14/60 VUs  0m21.0s/2m00.0s

running (0m22.0s), 14/60 VUs, 401 complete and 0 interrupted iterations
default   [  18% ] 14/60 VUs  0m22.0s/2m00.0s

running (0m23.0s), 15/60 VUs, 429 complete and 0 interrupted iterations
default   [  19% ] 15/60 VUs  0m23.0s/2m00.0s

running (0m24.0s), 16/60 VUs, 459 complete and 0 interrupted iterations
default   [  20% ] 16/60 VUs  0m24.0s/2m00.0s

running (0m25.0s), 16/60 VUs, 474 complete and 0 interrupted iterations
default   [  21% ] 16/60 VUs  0m25.0s/2m00.0s

running (0m26.0s), 17/60 VUs, 498 complete and 0 interrupted iterations
default   [  22% ] 17/60 VUs  0m26.0s/2m00.0s

running (0m27.0s), 18/60 VUs, 533 complete and 0 interrupted iterations
default   [  22% ] 18/60 VUs  0m27.0s/2m00.0s

running (0m28.0s), 18/60 VUs, 562 complete and 0 interrupted iterations
default   [  23% ] 18/60 VUs  0m28.0s/2m00.0s

running (0m29.0s), 19/60 VUs, 596 complete and 0 interrupted iterations
default   [  24% ] 19/60 VUs  0m29.0s/2m00.0s

running (0m30.0s), 19/60 VUs, 633 complete and 0 interrupted iterations
default   [  25% ] 19/60 VUs  0m30.0s/2m00.0s

running (0m31.0s), 20/60 VUs, 666 complete and 0 interrupted iterations
default   [  26% ] 20/60 VUs  0m31.0s/2m00.0s

running (0m32.0s), 21/60 VUs, 698 complete and 0 interrupted iterations
default   [  27% ] 21/60 VUs  0m32.0s/2m00.0s

running (0m33.0s), 21/60 VUs, 733 complete and 0 interrupted iterations
default   [  27% ] 21/60 VUs  0m33.0s/2m00.0s

running (0m34.0s), 22/60 VUs, 769 complete and 0 interrupted iterations
default   [  28% ] 22/60 VUs  0m34.0s/2m00.0s

running (0m35.0s), 23/60 VUs, 796 complete and 0 interrupted iterations
default   [  29% ] 23/60 VUs  0m35.0s/2m00.0s

running (0m36.0s), 23/60 VUs, 830 complete and 0 interrupted iterations
default   [  30% ] 23/60 VUs  0m36.0s/2m00.0s

running (0m37.0s), 24/60 VUs, 863 complete and 0 interrupted iterations
default   [  31% ] 24/60 VUs  0m37.0s/2m00.0s

running (0m38.0s), 25/60 VUs, 895 complete and 0 interrupted iterations
default   [  32% ] 25/60 VUs  0m38.0s/2m00.0s

running (0m39.0s), 25/60 VUs, 932 complete and 0 interrupted iterations
default   [  32% ] 25/60 VUs  0m39.0s/2m00.0s

running (0m40.0s), 26/60 VUs, 969 complete and 0 interrupted iterations
default   [  33% ] 26/60 VUs  0m40.0s/2m00.0s

running (0m41.0s), 27/60 VUs, 1008 complete and 0 interrupted iterations
default   [  34% ] 27/60 VUs  0m41.0s/2m00.0s

running (0m42.0s), 27/60 VUs, 1045 complete and 0 interrupted iterations
default   [  35% ] 27/60 VUs  0m42.0s/2m00.0s

running (0m43.0s), 28/60 VUs, 1087 complete and 0 interrupted iterations
default   [  36% ] 28/60 VUs  0m43.0s/2m00.0s

running (0m44.0s), 29/60 VUs, 1117 complete and 0 interrupted iterations
default   [  37% ] 29/60 VUs  0m44.0s/2m00.0s

running (0m45.0s), 29/60 VUs, 1146 complete and 0 interrupted iterations
default   [  37% ] 29/60 VUs  0m45.0s/2m00.0s

running (0m46.0s), 30/60 VUs, 1180 complete and 0 interrupted iterations
default   [  38% ] 30/60 VUs  0m46.0s/2m00.0s

running (0m47.0s), 31/60 VUs, 1209 complete and 0 interrupted iterations
default   [  39% ] 31/60 VUs  0m47.0s/2m00.0s

running (0m48.0s), 31/60 VUs, 1244 complete and 0 interrupted iterations
default   [  40% ] 31/60 VUs  0m48.0s/2m00.0s

running (0m49.0s), 32/60 VUs, 1279 complete and 0 interrupted iterations
default   [  41% ] 32/60 VUs  0m49.0s/2m00.0s

running (0m50.0s), 33/60 VUs, 1309 complete and 0 interrupted iterations
default   [  42% ] 33/60 VUs  0m50.0s/2m00.0s

running (0m51.0s), 33/60 VUs, 1333 complete and 0 interrupted iterations
default   [  42% ] 33/60 VUs  0m51.0s/2m00.0s

running (0m52.0s), 34/60 VUs, 1353 complete and 0 interrupted iterations
default   [  43% ] 34/60 VUs  0m52.0s/2m00.0s

running (0m53.0s), 35/60 VUs, 1367 complete and 0 interrupted iterations
default   [  44% ] 35/60 VUs  0m53.0s/2m00.0s

running (0m54.0s), 35/60 VUs, 1386 complete and 0 interrupted iterations
default   [  45% ] 35/60 VUs  0m54.0s/2m00.0s

running (0m55.0s), 36/60 VUs, 1401 complete and 0 interrupted iterations
default   [  46% ] 36/60 VUs  0m55.0s/2m00.0s

running (0m56.0s), 37/60 VUs, 1410 complete and 0 interrupted iterations
default   [  47% ] 37/60 VUs  0m56.0s/2m00.0s

running (0m57.0s), 37/60 VUs, 1439 complete and 0 interrupted iterations
default   [  47% ] 37/60 VUs  0m57.0s/2m00.0s

running (0m58.0s), 38/60 VUs, 1463 complete and 0 interrupted iterations
default   [  48% ] 38/60 VUs  0m58.0s/2m00.0s

running (0m59.0s), 39/60 VUs, 1500 complete and 0 interrupted iterations
default   [  49% ] 39/60 VUs  0m59.0s/2m00.0s

running (1m00.0s), 39/60 VUs, 1531 complete and 0 interrupted iterations
default   [  50% ] 39/60 VUs  1m00.0s/2m00.0s

running (1m01.0s), 40/60 VUs, 1544 complete and 0 interrupted iterations
default   [  51% ] 40/60 VUs  1m01.0s/2m00.0s

running (1m02.0s), 41/60 VUs, 1579 complete and 0 interrupted iterations
default   [  52% ] 41/60 VUs  1m02.0s/2m00.0s

running (1m03.0s), 41/60 VUs, 1605 complete and 0 interrupted iterations
default   [  52% ] 41/60 VUs  1m03.0s/2m00.0s

running (1m04.0s), 42/60 VUs, 1636 complete and 0 interrupted iterations
default   [  53% ] 42/60 VUs  1m04.0s/2m00.0s

running (1m05.0s), 43/60 VUs, 1670 complete and 0 interrupted iterations
default   [  54% ] 43/60 VUs  1m05.0s/2m00.0s

running (1m06.0s), 43/60 VUs, 1702 complete and 0 interrupted iterations
default   [  55% ] 43/60 VUs  1m06.0s/2m00.0s

running (1m07.0s), 44/60 VUs, 1719 complete and 0 interrupted iterations
default   [  56% ] 44/60 VUs  1m07.0s/2m00.0s

running (1m08.0s), 45/60 VUs, 1733 complete and 0 interrupted iterations
default   [  57% ] 45/60 VUs  1m08.0s/2m00.0s

running (1m09.0s), 45/60 VUs, 1745 complete and 0 interrupted iterations
default   [  57% ] 45/60 VUs  1m09.0s/2m00.0s

running (1m10.0s), 46/60 VUs, 1762 complete and 0 interrupted iterations
default   [  58% ] 46/60 VUs  1m10.0s/2m00.0s

running (1m11.0s), 47/60 VUs, 1783 complete and 0 interrupted iterations
default   [  59% ] 47/60 VUs  1m11.0s/2m00.0s

running (1m12.0s), 47/60 VUs, 1813 complete and 0 interrupted iterations
default   [  60% ] 47/60 VUs  1m12.0s/2m00.0s

running (1m13.0s), 48/60 VUs, 1835 complete and 0 interrupted iterations
default   [  61% ] 48/60 VUs  1m13.0s/2m00.0s

running (1m14.0s), 49/60 VUs, 1864 complete and 0 interrupted iterations
default   [  62% ] 49/60 VUs  1m14.0s/2m00.0s

running (1m15.0s), 49/60 VUs, 1896 complete and 0 interrupted iterations
default   [  62% ] 49/60 VUs  1m15.0s/2m00.0s

running (1m16.0s), 50/60 VUs, 1932 complete and 0 interrupted iterations
default   [  63% ] 50/60 VUs  1m16.0s/2m00.0s

running (1m17.0s), 51/60 VUs, 1966 complete and 0 interrupted iterations
default   [  64% ] 51/60 VUs  1m17.0s/2m00.0s

running (1m18.0s), 51/60 VUs, 1995 complete and 0 interrupted iterations
default   [  65% ] 51/60 VUs  1m18.0s/2m00.0s

running (1m19.0s), 52/60 VUs, 2025 complete and 0 interrupted iterations
default   [  66% ] 52/60 VUs  1m19.0s/2m00.0s

running (1m20.0s), 53/60 VUs, 2048 complete and 0 interrupted iterations
default   [  67% ] 53/60 VUs  1m20.0s/2m00.0s

running (1m21.0s), 53/60 VUs, 2059 complete and 0 interrupted iterations
default   [  67% ] 53/60 VUs  1m21.0s/2m00.0s

running (1m22.0s), 54/60 VUs, 2098 complete and 0 interrupted iterations
default   [  68% ] 54/60 VUs  1m22.0s/2m00.0s

running (1m23.0s), 55/60 VUs, 2119 complete and 0 interrupted iterations
default   [  69% ] 55/60 VUs  1m23.0s/2m00.0s

running (1m24.0s), 55/60 VUs, 2154 complete and 0 interrupted iterations
default   [  70% ] 55/60 VUs  1m24.0s/2m00.0s

running (1m25.0s), 56/60 VUs, 2191 complete and 0 interrupted iterations
default   [  71% ] 56/60 VUs  1m25.0s/2m00.0s

running (1m26.0s), 57/60 VUs, 2223 complete and 0 interrupted iterations
default   [  72% ] 57/60 VUs  1m26.0s/2m00.0s

running (1m27.0s), 57/60 VUs, 2255 complete and 0 interrupted iterations
default   [  72% ] 57/60 VUs  1m27.0s/2m00.0s

running (1m28.0s), 58/60 VUs, 2281 complete and 0 interrupted iterations
default   [  73% ] 58/60 VUs  1m28.0s/2m00.0s

running (1m29.0s), 59/60 VUs, 2314 complete and 0 interrupted iterations
default   [  74% ] 59/60 VUs  1m29.0s/2m00.0s

running (1m30.0s), 59/60 VUs, 2344 complete and 0 interrupted iterations
default   [  75% ] 59/60 VUs  1m30.0s/2m00.0s

running (1m31.0s), 60/60 VUs, 2371 complete and 0 interrupted iterations
default   [  76% ] 60/60 VUs  1m31.0s/2m00.0s

running (1m32.0s), 60/60 VUs, 2405 complete and 0 interrupted iterations
default   [  77% ] 60/60 VUs  1m32.0s/2m00.0s

running (1m33.0s), 60/60 VUs, 2434 complete and 0 interrupted iterations
default   [  77% ] 60/60 VUs  1m33.0s/2m00.0s

running (1m34.0s), 55/60 VUs, 2466 complete and 0 interrupted iterations
default   [  78% ] 55/60 VUs  1m34.0s/2m00.0s

running (1m35.0s), 52/60 VUs, 2497 complete and 0 interrupted iterations
default   [  79% ] 52/60 VUs  1m35.0s/2m00.0s

running (1m36.0s), 50/60 VUs, 2528 complete and 0 interrupted iterations
default   [  80% ] 50/60 VUs  1m36.0s/2m00.0s

running (1m37.0s), 48/60 VUs, 2560 complete and 0 interrupted iterations
default   [  81% ] 48/60 VUs  1m37.0s/2m00.0s

running (1m38.0s), 46/60 VUs, 2592 complete and 0 interrupted iterations
default   [  82% ] 46/60 VUs  1m38.0s/2m00.0s

running (1m39.0s), 44/60 VUs, 2618 complete and 0 interrupted iterations
default   [  82% ] 44/60 VUs  1m39.0s/2m00.0s

running (1m40.0s), 42/60 VUs, 2652 complete and 0 interrupted iterations
default   [  83% ] 42/60 VUs  1m40.0s/2m00.0s

running (1m41.0s), 39/60 VUs, 2681 complete and 0 interrupted iterations
default   [  84% ] 39/60 VUs  1m41.0s/2m00.0s

running (1m42.0s), 38/60 VUs, 2712 complete and 0 interrupted iterations
default   [  85% ] 38/60 VUs  1m42.0s/2m00.0s

running (1m43.0s), 36/60 VUs, 2745 complete and 0 interrupted iterations
default   [  86% ] 36/60 VUs  1m43.0s/2m00.0s

running (1m44.0s), 34/60 VUs, 2784 complete and 0 interrupted iterations
default   [  87% ] 34/60 VUs  1m44.0s/2m00.0s

running (1m45.0s), 31/60 VUs, 2821 complete and 0 interrupted iterations
default   [  87% ] 31/60 VUs  1m45.0s/2m00.0s

running (1m46.0s), 29/60 VUs, 2854 complete and 0 interrupted iterations
default   [  88% ] 29/60 VUs  1m46.0s/2m00.0s

running (1m47.0s), 27/60 VUs, 2885 complete and 0 interrupted iterations
default   [  89% ] 27/60 VUs  1m47.0s/2m00.0s

running (1m48.0s), 25/60 VUs, 2919 complete and 0 interrupted iterations
default   [  90% ] 25/60 VUs  1m48.0s/2m00.0s

running (1m49.0s), 23/60 VUs, 2954 complete and 0 interrupted iterations
default   [  91% ] 23/60 VUs  1m49.0s/2m00.0s

running (1m50.0s), 21/60 VUs, 2983 complete and 0 interrupted iterations
default   [  92% ] 21/60 VUs  1m50.0s/2m00.0s

running (1m51.0s), 20/60 VUs, 3019 complete and 0 interrupted iterations
default   [  92% ] 20/60 VUs  1m51.0s/2m00.0s

running (1m52.0s), 17/60 VUs, 3054 complete and 0 interrupted iterations
default   [  93% ] 17/60 VUs  1m52.0s/2m00.0s

running (1m53.0s), 15/60 VUs, 3083 complete and 0 interrupted iterations
default   [  94% ] 15/60 VUs  1m53.0s/2m00.0s

running (1m54.0s), 13/60 VUs, 3114 complete and 0 interrupted iterations
default   [  95% ] 13/60 VUs  1m54.0s/2m00.0s

running (1m55.0s), 11/60 VUs, 3147 complete and 0 interrupted iterations
default   [  96% ] 11/60 VUs  1m55.0s/2m00.0s

running (1m56.0s), 09/60 VUs, 3182 complete and 0 interrupted iterations
default   [  97% ] 09/60 VUs  1m56.0s/2m00.0s

running (1m57.0s), 07/60 VUs, 3214 complete and 0 interrupted iterations
default   [  97% ] 07/60 VUs  1m57.0s/2m00.0s

running (1m58.0s), 05/60 VUs, 3243 complete and 0 interrupted iterations
default   [  98% ] 05/60 VUs  1m58.0s/2m00.0s

running (1m59.0s), 03/60 VUs, 3273 complete and 0 interrupted iterations
default   [  99% ] 03/60 VUs  1m59.0s/2m00.0s

running (2m00.0s), 01/60 VUs, 3285 complete and 0 interrupted iterations
default   [ 100% ] 01/60 VUs  2m00.0s/2m00.0s

     data_received..................: 587 MB 4.9 MB/s
     data_sent......................: 352 kB 2.9 kB/s
     http_req_blocked...............: avg=21.48µs  min=2.13µs   med=5.91µs   max=7.66ms p(90)=15.15µs  p(95)=18.72µs
     http_req_connecting............: avg=9.98µs   min=0s       med=0s       max=7.5ms  p(90)=0s       p(95)=0s     
   ✓ http_req_duration..............: avg=999.89ms min=10.24ms  med=806.04ms max=7.05s  p(90)=1.79s    p(95)=2.02s  
       { expected_response:true }...: avg=999.89ms min=10.24ms  med=806.04ms max=7.05s  p(90)=1.79s    p(95)=2.02s  
   ✓ http_req_failed................: 0.00%  ✓ 0        ✗ 3286
     http_req_receiving.............: avg=18.33ms  min=78.36µs  med=237.54µs max=2.56s  p(90)=846.08µs p(95)=1.56ms 
     http_req_sending...............: avg=31.7µs   min=7.76µs   med=19.74µs  max=5.7ms  p(90)=52.22µs  p(95)=64.41µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s     p(90)=0s       p(95)=0s     
     http_req_waiting...............: avg=981.52ms min=9.97ms   med=805.03ms max=5.45s  p(90)=1.79s    p(95)=1.99s  
     http_reqs......................: 3286   27.37181/s
     iteration_duration.............: avg=1.1s     min=111.15ms med=907.52ms max=7.16s  p(90)=1.89s    p(95)=2.12s  
     iterations.....................: 3286   27.37181/s
     vus............................: 1      min=1      max=60
     vus_max........................: 60     min=60     max=60


running (2m00.1s), 00/60 VUs, 3286 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/60 VUs  2m0s